artillery/complex-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 30
      arrivalRate: 2
      rampTo: 10
      name: "Ramp up load"
    - duration: 60
      arrivalRate: 10
      name: "Sustained load"
  plugins:
    expect: {}

scenarios:
  - name: "Booking workflow"
    flow:
      # Check room availability
      - post:
          url: "/v1/bookings/check-availability"
          json:
            room_num: 201
            check_in_date: "2025-03-01T14:00:00Z"
            check_out_date: "2025-03-05T12:00:00Z"
          expect:
            - statusCode: 200

      # Create booking
      - post:
          url: "/v1/bookings"
          json:
            room_num: 201
            guest_id: 1
            check_in_date: "2025-03-01T14:00:00Z"
            check_out_date: "2025-03-05T12:00:00Z"
          capture:
            - json: "$.booking_id"
              as: "bookingId"
          expect:
            - statusCode: [201, 409] # Either created or conflict

      # Get booking details
      - get:
          url: "/v1/bookings/{{ bookingId }}"
          expect:
            - statusCode: 200